<a href="https://colab.research.google.com/github/anshdeepkaur53/Accident-analysis/blob/master/TITANIC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
from google.colab import files
uploaded=files.upload()

Saving Titanic.csv to Titanic.csv

In [4]:
df = pd.read_csv("Titanic.csv")

In [5]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [7]:
for i in range(len(df)):
  if(df.loc[i,'Sex'] == 'male'):
        df.loc[i,'Sex'] = int(1)
  else:
        df.loc[i,'Sex'] = int(0)

In [8]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
cm=0
cf=0
print("Survival Ratio Of Men : Women ")
for i in range(len(df)):
  if(df.Pclass[i]==1):
    if(df.Sex[i] == 1 and df.Survived[i] ==1):
      cm+=1
    elif(df.Sex[i]==0 and df.Survived[i] ==1):
      cf+=1
rat=float(cm/cf)
print("Pclass 1 :",rat)

for i in range(len(df)):
  if(df.Pclass[i]==2):
    if(df.Sex[i] == 1 and df.Survived[i] ==1):
      cm+=1
    elif(df.Sex[i]==0 and df.Survived[i] ==1):
      cf+=1
rat=float(cm/cf)
print("Pclass 2 :",rat)

for i in range(len(df)):
  if(df.Pclass[i]==3):
    if(df.Sex[i] == 1 and df.Survived[i] ==1):
      cm+=1
    elif(df.Sex[i]==0 and df.Survived[i] ==1):
      cf+=1
rat=float(cm/cf)
print("Pclass 3 :",rat)

Survival Ratio Of Men : Women
Pclass 1 : 0.4945054945054945
Pclass 2 : 0.38509316770186336
Pclass 3 : 0.4678111587982833